Repository: Eremex/controls-demo
Catalog: DemoCenter/DemoCenter/Resources.*.resx
Languages: ru, zh_hans

# TheEditorsLibraryIncludesTheTextEditorAndB
source: The Editors library includes the Text Editor and Button Editor controls that provide base text editing capabilities: data validation, watermarks (hints displayed when the editor is empty), and multiple options to control text selection and data edit operations. The Button Editor supports an unlimited number of built-in regular and check buttons, which can display text or images at the left or right edge of the edit box.
ru: Библиотека редакторов включает элементы управления Text Editor и Button Editor, которые предоставляют базовые функции для редактирования текста: проверку данных (валидацию), водяные знаки (подсказки, которые отображаются, если редактор пуст), а также различные опции для управления выбором текста и операциями редактирования. Button Editor поддерживает неограниченное количество встроенных кнопок, как обычных, так и переключаемых, которые могут отображать текст или изображение и располагаться справа или слева.
zh_hans: 编辑器库包括 Text Editor 和 Button Editor 控件，它们提供基本的文本编辑功能：数据验证、水印（编辑器为空时显示的提示）以及控制文本选择和数据编辑操作的多个选项。Button Editor 支持无限数量的内置常规按钮和复选框按钮，它们可以在编辑框的左侧或右侧显示文本或图像。

# TheSpinEditorIsANumericValueEditorWithBuil
source: The Spin Editor is a numeric value editor with built-in spin buttons used to increase and decrease a number by a specific value (increment). A user can increment and decrement the number by clicking these buttons, or by pressing the Up and Down Arrows on the keyboard. SpinEditor uses a numeric mask to restrict user input to numeric values only, and to format the edit value according to the specified pattern.
ru: Spin Editor — это редактор числовых значений, оснащенный кнопками вверх и вниз, которые позволяют увеличивать или уменьшать число на заданное значение (инкремент). Пользователь может изменять значение, нажимая эти кнопки или используя клавиши со стрелками вверх и вниз на клавиатуре. Spin Editor использует числовую маску, чтобы ограничить ввод только числовыми значениями и отформатировать редактируемое значение в соответствии с указанным шаблоном.
zh_hans: Spin Editor 是一个数值编辑器，带有用于按特定值（增量）增加和减少数字的内置旋转按钮。用户可以通过单击这些按钮或按键盘上的上下箭头来增加和减少数字。SpinEditor 使用数字掩码将用户输入限制为仅数字值，并根据指定的模式格式化编辑值。

# TheComboBoxEditorFeaturesADropdownListOfIt
source: The ComboBox Editor features a dropdown list of items from which a user can select one or more items. The editor can display a list of strings, a list of business objects, or enumeration values. In multi-select mode, item check boxes allow the user to select multiple items at a time.
ru: Редактор ComboBox Editor предоставляет выпадающий список элементов, из которых пользователь может выбрать один или несколько вариантов. Редактор может отображать список строк, список бизнес-объектов или значения перечисления. В режиме множественного выбора флажки рядом с элементами позволяют пользователю выбирать несколько элементов одновременно.
zh_hans: ComboBox Editor 具有一个下拉列表，用户可以从列表中选择一个或多个项目。编辑器可以显示字符串列表、业务对象列表或枚举值。在多选模式下，项目复选框允许用户一次选择多个项目。

# YouCanUseTheSegmentedEditorToPresentASetOf
source: You can use the Segmented Editor to present a set of options as horizontally arranged segments. A user can click one of the segments to select a corresponding option, or CTRL-click on a selected segment to clear the selection. The editor allows you to populate segments from a list of strings, a list of business objects, or an enumeration type.
ru: Вы можете использовать Segmented Editor для отображения набора опций в виде горизонтально расположенных сегментов. Пользователь может щелкнуть по одному из сегментов, чтобы выбрать соответствующую опцию, или нажать CTRL + щелчок на выбранном сегменте, чтобы снять выделение. Редактор позволяет создавать сегменты из списка строк, списка бизнес-объектов или значений перечисления.
zh_hans: 您可以使用 Segmented Editor 将一组选项呈现为水平排列的段。用户可以单击其中一个段以选择相应的选项，或按住 CTRL 键单击选定的段以清除选择。编辑器允许您从字符串列表、业务对象列表或枚举类型填充段。

# TheDateEditorFeaturesADropdownCalendarThat
source: The Date Editor features a dropdown calendar that allows users to select a date. The calendar's navigation bar enables the user to browse through months and years. DateEditor uses a date-time mask to restrict user input to date-time values only, and to format the edit value according to the specified pattern.
ru: Редактор Date Editor предоставляет выпадающий календарь, который позволяет пользователям выбирать дату. Панель навигации календаря дает возможность перемещаться между месяцами и годами. Date Editor использует маску даты и времени, чтобы ограничить ввод пользователя только допустимыми значениями даты и времени, а также отформатировать редактируемое значение в соответствии с заданным шаблоном.
zh_hans: Date Editor 具有一个下拉日历，允许用户选择日期。日历的导航栏使用户可以浏览月份和年份。DateEditor 使用日期时间掩码将用户输入限制为仅日期时间值，并根据指定的模式格式化编辑值。

# TheColorEditorAndPopupColorEditorControlsA
source: The Color Editor and Popup Color Editor controls allow a user to select a color. The controls support three color palettes: default (customizable in code), standard (fixed colors), and custom (customizable by users). The built-in Color Picker helps the user add custom colors from a color space, or specify color values in the RGB and HSB formats.
ru: Элементы управления Color Editor и Popup Color Editor позволяют пользователю выбирать цвет. Они поддерживают три цветовые палитры: по умолчанию (которую можно настроить в коде), стандартную (с фиксированными цветами) и пользовательскую (которую может настраивать сам пользователь). Встроенный Color Picker помогает пользователю добавлять пользовательские цвета из цветового пространства или задавать значения цвета в форматах RGB и HSB.
zh_hans: Color Editor 和 Popup Color Editor 控件允许用户选择颜色。这些控件支持三种调色板：默认（可在代码中自定义）、标准（固定颜色）和自定义（用户可自定义）。内置的颜色选择器帮助用户从颜色空间添加自定义颜色，或以 RGB 和 HSB 格式指定颜色值。

# TheHyperlinkEditorDisplaysItsContentAsAHyp
source: The Hyperlink Editor displays its content as a hyperlink. The editor supports manual (default) and automatic hyperlink processing. A dedicated command or event allows you to manually handle hyperlink clicks. Enable automatic hyperlink navigation to allow the editor to automatically execute a link on a click.
ru: Редактор Hyperlink Editor отображает содержимое в виде гиперссылки. Он поддерживает ручную (по умолчанию) и автоматическую обработку гиперссылок. Специальная команда или событие позволяет обрабатывать клики по гиперссылкам. Вы можете включить автоматическую навигацию, чтобы редактор автоматически переходил по ссылке при клике.
zh_hans: Hyperlink Editor 将其内容显示为超链接。编辑器支持手动（默认）和自动超链接处理。专用命令或事件允许您手动处理超链接点击。启用自动超链接导航以允许编辑器在点击时自动执行链接。

# YouCanCreateComboBoxAndSegmentedEditorsIte
source: You can create ComboBox and Segmented Editors' items from enumeration type values. Dedicated Data Annotation attributes applied to the enumeration values allow you to populate the controls' items with images, display text and tooltips.
ru: Вы можете создавать элементы для контролов ComboBox и Segmented Editor на основе значений типа перечисления. С помощью специальных атрибутов Data Annotation, примененных к значениям перечисления, можно задать изображения, текст и подсказки для этих элементов.
zh_hans: 您可以从枚举类型值创建 ComboBox 和 Segmented Editors 的项目。应用于枚举值的专用 Data Annotation 属性允许您使用图像、显示文本和工具提示填充控件的项目。

# UseMemoEditorToDisplayAndEditLargeTextInAP
source: Use MemoEditor to display and edit large text in a popup window, with or without text wrapping enabled. The IsTextEditable property allows you to prevent text editing in the edit box. When the property is false, the edit box can display a special icon that indicates the presence of text in the popup.
ru: Используйте редактор MemoEditor для отображения и редактирования больших текстов в выпадающем окне, с возможностью включения или отключения переноса текста. Свойство IsTextEditable позволяет запретить редактирование текста в поле ввода. Если свойство установлено в значение false, поле ввода может отображать специальный значок, указывающий на наличие текста в выпадающем окне.
zh_hans: 使用 MemoEditor 在弹出窗口中显示和编辑大文本，无论是否启用文本换行。IsTextEditable 属性允许您防止在编辑框中编辑文本。当该属性为 false 时，编辑框可以显示一个特殊图标，指示弹出窗口中存在文本。

# Graphics3DControlAllowsYouToVisualizeAndIn
source: Graphics3DControl allows you to visualize and interact with 3D models. Use the Properties pane on the right to customize the control's basic rendering and behavior settings.
ru: Graphics3DControl позволяет отображать и взаимодействовать с 3D-моделями. С помощью панели свойств справа вы можете настроить основные параметры рендеринга и поведения контрола.
zh_hans: Graphics3DControl 允许您可视化和与 3D 模型交互。使用右侧的属性窗格自定义控件的基本渲染和行为设置。

# ThisExampleDemonstratesAGraphics3DControlT
source: This example demonstrates a Graphics3DControl that renders a 3D model using lines.
ru: Этот пример показывает, как использовать контрол Graphics3DControl для отображения 3D-модели с помощью линий.
zh_hans: 此示例展示了一个使用线条渲染 3D 模型的 Graphics3DControl。

# ThisExampleDemonstratesAGraphics3DControlT1
source: This example demonstrates a Graphics3DControl that renders a 3D model using points.
ru: Этот пример показывает, как использовать контрол Graphics3DControl для отображения 3D-модели с помощью точек.
zh_hans: 此示例展示了一个使用点渲染 3D 模型的 Graphics3DControl。

# ThisExampleDemonstratesDynamicTransformati
source: This example demonstrates dynamic transformations applied to 3D Models in a Graphics3DControl.
ru: Этот пример демонстрирует динамические преобразования, применяемые к 3D-моделям в элементе управления Graphics3DControl.
zh_hans: 此示例展示了应用于 Graphics3DControl 中 3D 模型的动态变换。

# ThisExampleDemonstratesAGraphics3DControlD
source: This example demonstrates a Graphics3DControl displaying a large 3D model loaded from an STL file. The STLDotNet6.Formats.StereoLithography library is used to parse the STL file, and to obtain data to initialize vertices and materials of the created model.
ru: Этот пример показывает, как загрузить модель из файла STL и отобразить ее с помощью контрола Graphics3DControl. Библиотека STLDotNet6.Formats.StereoLithography используется для анализа файла STL и получения данных, необходимых для инициализации вершин и материалов создаваемой модели.
zh_hans: 此示例展示了一个 Graphics3DControl，它显示从 STL 文件加载的大型 3D 模型。使用 STLDotNet6.Formats.StereoLithography 库解析 STL 文件，并获取数据以初始化创建的模型的顶点和材质。

# ThisExampleDemonstratesAGraphics3DControlD1
source: This example demonstrates a Graphics3DControl displaying a 3D model with a simple material. Use the Properties pane on the right to customize the material settings.
ru: Этот пример показывает, как отобразить 3D-модель с простым материалом в контроле Graphics3DControl. С помощью панели свойств справа вы можете настроить параметры материала.
zh_hans: 此示例展示了一个显示具有简单材质的 3D 模型的 Graphics3DControl。使用右侧的属性窗格自定义材质设置。

# InThisExampleAGraphics3DControlDisplaysA3D
source: In this example, a Graphics3DControl displays a 3D model with a textured material. Use the Materials pane on the right to choose the texture.
ru: Этот пример демонстрирует, как отобразить 3D-модель с текстурированным материалом в контроле Graphics3DControl. С помощью панели материалов справа вы можете выбрать текстуру.
zh_hans: 在此示例中，Graphics3DControl 显示具有纹理材质的 3D 模型。使用右侧的材质窗格选择纹理。

# ThisExampleDemonstratesTheIsometricAndPers
source: This example demonstrates the isometric and perspective cameras supported by Graphics3DControl. Use the Camera pane on the right to choose camera mode and one of predefined camera views.
ru: Этот пример показывает, как работают изометрические и перспективные камеры в контроле Graphics3DControl. С помощью панели справа вы можете выбрать режим камеры и один из предустановленных видов.
zh_hans: 此示例展示了 Graphics3DControl 支持的等距和透视相机。使用右侧的相机窗格选择相机模式和预定义的相机视图之一。

# AHeatmapRendersA2DimensionalArrayOfValuesA
source: A heatmap renders a 2-dimensional array of values as a color-encoded matrix. Each data point's color corresponds to the data point's value. This example demonstrates the Heatmap control which allows you to create heatmaps from your data. Click a color gradient on the right to apply this color encoding to the heatmap. Image source: Webb Space Telescope, https://webbtelescope.org/
ru: Тепловая карта визуализирует двумерный массив значений в виде цветовой матрицы, где цвет каждой точки соответствует ее значению. Этот пример демонстрирует контрол Heatmap, позволяющий создавать тепловые карты на основе ваших данных. Щелкните по цветовому градиенту справа, чтобы применить это цветовое кодирование к тепловой карте. Источник изображения: Webb Space Telescope, https://webbtelescope.org/
zh_hans: 热力图将二维数组的值渲染为颜色编码的矩阵。每个数据点的颜色对应于数据点的值。此示例展示了热力图控件，它允许您从数据创建热力图。单击右侧的颜色渐变以将此颜色编码应用于热力图。 图片来源：韦伯太空望远镜，https://webbtelescope.org/

# InThisExampleTheHeatmapControlUsesCustomCo
source: In this example the Heatmap control uses custom color encoding to visualize the intensity of a sample signal changing in real time. A chart control at the top displays the amplitude of this signal. The controls update seamlessly as the underlying data changes using a timer.
ru: В этом примере контрол Heatmap применяет пользовательское цветовое кодирование для отображения интенсивности сигнала, который изменяется в реальном времени. График в верхней части окна показывает амплитуду этого сигнала. Элементы управления плавно обновляются по мере изменения данных с использованием таймера.
zh_hans: 在此示例中，热力图控件使用自定义颜色编码来实时可视化样本信号的强度变化。顶部的图表控件显示此信号的振幅。控件在底层数据变化时通过计时器无缝更新。

# InAPolarChartEachDataPointIsDeterminedByAn
source: In a Polar Chart each data point is determined by an angle and a distance. This example demonstrates constant lines and strips used to highlight specific values and value ranges. Angle ranges and distance ranges are set in code of this demo. Left-click within a diagram to create custom constant lines for angles. Right-click to create custom constant lines for distances.
ru: В полярной диаграмме каждая точка данных определяется углом и расстоянием. Этот пример показывает, как используются постоянные линии и полосы для выделения конкретных значений и диапазонов. Диапазоны углов и расстояний задаются в коде этого примера. Щелкните левой кнопкой мыши внутри диаграммы, чтобы создать пользовательские постоянные линии для углов. Щелкните правой кнопкой мыши, чтобы создать пользовательские постоянные линии для расстояний.
zh_hans: 在极坐标图中，每个数据点由角度和距离确定。此示例展示了用于突出显示特定值和值范围的常量和带状区域。角度范围和距离范围在此演示的代码中设置。在图表内左键单击以创建角度的自定义常量线。右键单击以创建距离的自定义常量线。

# ThisExampleDemonstratesThePointSeriesViewW1
source: This example demonstrates the Point series view, which allows you to plot individual points.
ru: Этот пример показывает, как работает представление данных Point Series View, позволяющее отображать данные в виде точек.
zh_hans: 此示例展示了点系列视图，它允许您绘制单个点。

# TheLineSeriesViewShownInThisExampleAllowsY1
source: The Line series view shown in this example allows you to draw a chart by connecting points with lines.
ru: В этом примере демонстрируется представление данных Line Series View, которое позволяет построить график, где точки данных соединены линиями.
zh_hans: 此示例中展示的线系列视图允许您通过连接点来绘制图表。

# TheAreaSeriesViewAllowsYouDisplayFilledAre1
source: The Area series view allows you display filled areas between a chart and point Zero. This view is helpful when you need to visually compare two or more data series.
ru: Представление данных Area Series View позволяет заполнять области между графиками и осью X. Это представление полезно, когда вам нужно визуально сравнить две или более серии данных.
zh_hans: 区域系列视图允许您显示图表与零点之间的填充区域。当您需要直观地比较两个或多个数据系列时，此视图非常有用。

# TheScatterLineSeriesViewIsUsefulWhenYouNee1
source: The Scatter Line series view is useful when you need to connect points in the order in which they appear in the data series.
ru: Представление данных Scatter Line Series View позволяет соединить точки в том порядке, в котором они расположены в серии данных.
zh_hans: 散点线系列视图在您需要按数据系列中出现的顺序连接点时非常有用。

# ADataSeriesInThisExampleContainsTwoYValues2
source: A data series in this example contains two Y-values for each data point. The Range Area view fills the area between these Y-values.
ru: Серия данных в этом примере содержит по два значения Y для каждой точки. Представление Range Area используется, чтобы заполнить области между этими значениями Y.
zh_hans: 此示例中的数据系列包含每个数据点的两个 Y 值。范围区域视图填充这些 Y 值之间的区域。

# PropertyGridAutomaticallyDetectsTheTypeOfB
source: Property Grid automatically detects the type of bound fields, and uses appropriate Eremex data editors to display and edit cell values. You can explicitly assign editors to specific fields to override the default behavior and customize editor settings.
ru: Контрол Property Grid автоматически определяет тип связанных полей и использует соответствующие редакторы Eremex для отображения и редактирования значений ячеек. Вы можете явно назначить редакторы для конкретных полей, чтобы переопределить поведение по умолчанию и настроить параметры редактора.
zh_hans: 属性网格自动检测绑定字段的类型，并使用适当的 Eremex 数据编辑器来显示和编辑单元格值。您可以显式地为特定字段分配编辑器，以覆盖默认行为并自定义编辑器设置。

# PropertyGridTabRowsAllowYouToGroupASetOfFi
source: Property Grid tab rows allow you to group a set of fields into a tabbed UI. Each tab item in a row displays its own set of bound fields.
ru: Строки-вкладки в контроле Property Grid позволяют организовать набор полей в интерфейс с вкладками (Tabbed UI). Каждая вкладка может отображать свой собственный набор полей.
zh_hans: 属性网格的选项卡行允许您将一组字段分组到选项卡式用户界面中。每行中的选项卡项显示其自己的一组绑定字段。

# RibbonControlAllowsYouToIntegrateMicrosoft
source: RibbonControl allows you to integrate Microsoft Office-inspired navigation menus into your Avalonia UI applications. The control comes with two views: Classic (three item rows) and Simplified (one item row). The dropdown button at the control's bottom right corner opens a selector between these views. {0}RibbonControl supports multiple item types: large and small buttons, check buttons, sub-menus, in-place editors, inline and dropdown galleries, groups of buttons, and more. You can create as many pages with items as you need, and place items in the Quick Access Toolbar or the tab header area. {1}Press the ALT key to focus the Ribbon, and then use the keyboard to navigate between Ribbon elements and activate commands.
ru: Контрол RibbonControl позволяет добавлять навигационные меню в стиле Microsoft Office в ваши приложения на Avalonia UI. Элемент управления поддерживает два режима отображения: Классический (три строки элементов) и Упрощенный (одна строка элементов). Нажатие на кнопку в правом нижнем углу контрола открывает список, с помощью которого пользователь может выбрать один из этих двух режимов. {0}RibbonControl поддерживает различные типы элементов: большие и маленькие кнопки, переключаемые кнопки, подменю, встроенные редакторы, встроенные и выпадающие галереи, группы кнопок и многое другое. Вы можете создать любое количество страниц с элементами и разместить элементы на панели быстрого доступа или в области заголовков вкладок. {1}Нажмите клавишу ALT, чтобы перевести фокус на RibbonControl, а затем используйте клавиатуру для навигации между элементами риббона и активации команд.
zh_hans: RibbonControl 允许您将受 Microsoft Office 启发的导航菜单集成到您的 Avalonia UI 应用程序中。该控件提供两种视图：经典视图（三行项目）和简化视图（一行项目）。控件右下角的下拉按钮打开一个选择器以在这些视图之间切换。{0}RibbonControl 支持多种项目类型：大按钮和小按钮、复选框按钮、子菜单、内置编辑器、内联和下拉画廊、按钮组等。您可以根据需要创建任意数量的页面，并将项目放置在快速访问工具栏或选项卡标题区域。{1}按下 ALT 键以聚焦到功能区，然后使用键盘在功能区元素之间导航并激活命令。

# ThisExampleDemonstratesThePointSeriesViewW2
source: This example demonstrates the Point series view, which allows you to plot individual points on the Smith diagram.
ru: Этот пример показывает, как работает представление данных Point Series View, позволяющее отображать данные в виде точек на диаграмме Смита.
zh_hans: 此示例展示了点系列视图，它允许您在史密斯图上绘制单个点。

# TheScatterLineSeriesViewIsUsefulWhenYouNee2
source: The Scatter Line series view is useful when you need to connect points in the order in which they appear in the data series.
ru: Этот пример показывает, как работает представление данных Scatter Line Series View. Оно позволяет соединить точки в том порядке, в котором они расположены в серии данных.
zh_hans: 散点线系列视图在您需要按数据系列中出现的顺序连接点时非常有用。

# TheTreeListSAutoFilterRowDisplayedAtTheTop
source: The Tree List's Auto-Filter Row displayed at the top of the control allows you to quickly find rows that contain specific values. Start typing in the Auto-Filter Row in one or multiple columns to filter data. The Search Panel is another way to locate information in the Tree List. Press CTRL+F to activate the Search Panel, and then type text to search through the control's data.
ru: Строка автоматической фильтрации, расположенная в верхней части контрола, позволяет быстро находить строки, содержащие определенные значения. Начните вводить текст в строке автоматической фильтрации в одном или нескольких столбцах, чтобы отфильтровать данные. Панель поиска — это еще один способ поиска информации в контроле Tree List. Нажмите CTRL+F, чтобы активировать панель поиска, а затем введите текст для поиска по данным.
zh_hans: 树列表的自动过滤行显示在控件的顶部，允许您快速查找包含特定值的行。在一个或多个列的自动过滤行中开始输入以过滤数据。搜索面板是另一种在树列表中定位信息的方式。按下 CTRL+F 激活搜索面板，然后输入文本以搜索控件的数据。

# EremexEditorsAreUsedInTreeListCellsByDefau
source: Eremex editors are used in Tree List cells by default to display and edit cell values of common data types (Boolean, integer, enumerations, etc.). This demo shows implicitly assigned in-place editors, and demonstrates how you can explicitly specify an editor for a Tree List column.
ru: Редакторы Eremex по умолчанию применяются в ячейках Tree List для отображения и редактирования значений ячеек стандартных типов данных (логические, целые числа, перечисления и т.д.). Этот пример демонстрирует неявно назначенные встроенные редакторы, а также показывает, как можно явно указать редактор для столбца.
zh_hans: 默认情况下，Eremex 编辑器用于树列表单元格中以显示和编辑常见数据类型（布尔值、整数、枚举等）的单元格值。此演示展示了隐式分配的内置编辑器，并演示了如何显式指定树列表列的编辑器。

# YouCanBindTreeListToAHierarchicalDataSourc
source: You can bind Tree List to a hierarchical data source, which returns child data through a collection property or special data selector. This demo shows how to create a selector that supplies the hierarchical structure of folders on your disk.
ru: Вы можете привязать Tree List к иерархическому источнику данных, который возвращает дочерние элементы через свойство коллекции или специальный селектор. Этот пример демонстрирует, как создать селектор, который предоставляет иерархическую структуру папок на вашем диске.
zh_hans: 您可以将树列表绑定到分层数据源，该数据源通过集合属性或特殊数据选择器返回子数据。此演示展示了如何创建一个选择器，以提供磁盘上文件夹的分层结构。

# TheTreeListAndTreeViewControlsSupportMulti
source: The TreeList and TreeView controls support multiple node selection mode, which allows you and your user to select (highlight) multiple nodes at one time. Users can select multiple nodes with the mouse and keyboard. Click nodes while holding the CTRL and/or SHIFT key down for node selection.
ru: Контролы TreeList и TreeView поддерживают режим множественного выбора строк, позволяющий выделять несколько строк одновременно. Пользователи могут осуществлять множественный выбор с помощью мыши и клавиатуры. Для выбора строк удерживайте клавиши CTRL и/или SHIFT и нажмите на строки кнопкой мыши.
zh_hans: 树列表和树视图控件支持多节点选择模式，允许您和用户一次选择（突出显示）多个节点。用户可以使用鼠标和键盘选择多个节点。按住 CTRL 和/或 SHIFT 键单击节点以选择节点。

# WASMOnlyText1
source: This demo is only available in Desktop mode. Download the
ru: Этот демо модуль доступен только в режиме для ПК. Скачайте приложение
zh_hans: 此演示仅适用于桌面模式。下载应用程序。

# WASMOnlyText2
source: solution and run the DemoCenter.Desktop project to see this demo.
ru: и запустите проект DemoCenter.Desktop
zh_hans: 解决方案并运行 DemoCenter.Desktop 项目以查看此演示。
