Repository: Eremex/controls-demo
Catalog: DemoCenter/DemoCenter/Resources.*.resx
Languages: ru, zh_hans

# EremexTabControlCanOrganizeTheContentsOfAB
source: Eremex Tab Control can organize the contents of a bound item source into a tabbed UI. It supports tab re-ordering, multiple tab layout modes, and built-in buttons to add and close tabs.
ru: MXTabControl позволяет организовать содержимое связанного источника элементов в виде интерфейса с вкладками. Он поддерживает возможность перестановки вкладок, различные варианты их отображения, а также встроенные кнопки для добавления и закрытия вкладок.
zh_hans: Eremex Tab Control 可以将绑定项源的内容组织成选项卡式用户界面。它支持选项卡重新排序、多种选项卡布局模式以及用于添加和关闭选项卡的内置按钮。

# TheMxMessageBoxDialogAllowsYouToDisplayMes
source: The MxMessageBox dialog allows you to display messages and ask questions to users. The dialog supports the Eremex paint themes, and it looks consistent with other EMX Controls in your project. Use the visual elements on the right to customize and show a sample message box.
ru: MxMessageBox — диалоговое окно, которое позволяет показывать сообщения и задавать вопросы пользователям. Оно поддерживает темы оформления Eremex и гармонично сочетается с другими элементами управления EMX в вашем проекте. С помощью элементов управления справа вы можете настроить диалоговое окно и затем показать его.
zh_hans: MxMessageBox 对话框允许您向用户显示消息并提问。该对话框支持 Eremex 绘制主题，并且与项目中的其他 EMX 控件保持一致。使用右侧的可视元素自定义并显示示例消息框。

# SplitContainerControlAllowsYouToPlaceConte
source: Split Container Control allows you to place content onto two panels, and separate the panels with a splitter that a user can drag to resize the panels. With the panel collapse feature enabled, the user can click the splitter to collapse and restore a panel.
ru: Split Container Control состоит из разделенных сплиттером двух панелей, на которых вы можете размещать другие контролы. Пользователь может перетаскивать сплиттер, чтобы изменять размер панелей. Если функция сворачивания панелей активна, можно щелкнуть по сплиттеру, чтобы свернуть или развернуть нужную панель.
zh_hans: Split Container Control 允许您将内容放置在两个面板上，并通过用户可拖动的分隔条来调整面板大小。启用面板折叠功能后，用户可以单击分隔条以折叠和恢复面板。

# TheDockManagerComponentAllowsYouToImplemen
source: The Dock Manager component allows you to implement the classic docking UI found in popular IDEs. You can create tool panels that support dock, auto-hide, and float operations. Special Document containers are designed to display the main content of your window. You can create multiple Documents and organize them into a tabbed UI.
ru: Компонент Dock Manager позволяет реализовать классический интерфейс Докинга, аналогичный тому, что используется в популярных средах разработки (IDE). С его помощью можно создавать панели инструментов, которые можно закреплять, переводить в режим свободного перемещения (плавающий режим) или настроить на автоматическое скрытие. Для отображения основного содержимого окна предусмотрены специальные контейнеры документов. Вы можете добавлять несколько документов и организовывать их в виде интерфейса с вкладками.
zh_hans: Dock Manager 组件允许您实现流行 IDE 中的经典停靠用户界面。您可以创建支持停靠、自动隐藏和浮动操作的工具面板。特殊的文档容器设计用于显示窗口的主要内容。您可以创建多个文档并将其组织成选项卡式用户界面。

# TheToolbarManagerComponentAllowsYouToImple
source: The ToolbarManager component allows you to implement a classic toolbar and menu UI. You can dock toolbars not only at the edges of the window, but also at any specified position. Users can customize the toolbar layout using drag-and-drop operations. They can also display the Customization Window to access all (hidden and visible) toolbar items, and move the items using drag-and-drop operations.
ru: Компонент ToolbarManager позволяет создать классические панели инструментов и меню. Панели инструментов можно закреплять не только по краям, но и в любом месте родительского контейнера. Пользователи могут изменять расположение элементов на панели инструментов с помощью перетаскивания. Также доступно окно настройки, где можно управлять всеми элементами панели инструментов (как скрытыми, так и видимыми) и перемещать их с помощью перетаскивания.
zh_hans: ToolbarManager 组件允许您实现经典的工具栏和菜单用户界面。您不仅可以将工具栏停靠在窗口边缘，还可以停靠在任何指定位置。用户可以使用拖放操作自定义工具栏布局。他们还可以显示自定义窗口以访问所有（隐藏和可见的）工具栏项，并使用拖放操作移动这些项。

# TheToolbarsMenuLibraryContainsAPopupMenuCo
source: The Toolbars & Menu library contains a PopupMenu component that you can use to attach a context menu to any control. Eremex context menu style settings are consistent with all toolbar library components.
ru: Библиотека Toolbars&Menus содержит компонент PopupMenu, с помощью которого можно добавить контекстное меню к любому элементу управления. Дизайн контекстного меню выполнен в едином стиле и гармонично сочетается с другими компонентами библиотеки EMX Controls.
zh_hans: 工具栏和菜单库包含一个 PopupMenu 组件，您可以使用它将上下文菜单附加到任何控件。Eremex 上下文菜单样式设置与所有工具栏库组件一致。

# TheChartControlSupportsInstantDisplayOfRap
source: The Chart Control supports instant display of rapidly changing real-time data. This example shows how to use a special data adapter to implement a moving viewport.
ru: Chart Control позволяет мгновенно отображать данные, которые быстро меняются в реальном времени. В данном примере показано, как с помощью специального адаптера данных можно реализовать движущееся окно просмотра.
zh_hans: Chart Control 支持即时显示快速变化的实时数据。此示例展示了如何使用特殊的数据适配器实现移动视口。

# TheChartControlSGraphicsRenderingIsOptimiz
source: The Chart Control's graphics rendering is optimized to display large data. The control provides high performance even when series contain millions of points
ru: Механизм отрисовки в элементе управления Chart Control оптимизирован для обработки больших объемов данных. Он обеспечивает высокую производительность и плавное отображение, даже если серии содержат миллионы точек.
zh_hans: Chart Control 的图形渲染经过优化，可以显示大量数据。即使系列包含数百万个点，控件仍能提供高性能。

# ThisExampleDemonstratesACartesianChartCont
source: This example demonstrates a CartesianChart control that has multiple data series and axes. You can use the mouse to scroll and zoom the entire chart area or individual axes. Use the options panel to change the main axis settings.
ru: Данный пример показывает элемент управления CartesianChart, в котором содержатся несколько серий данных и осей. Используйте мышку для прокрутки и масштабирования всей области диаграммы или отдельных осей. Для изменения основных настроек оси воспользуйтесь панелью параметров.
zh_hans: 此示例展示了一个具有多个数据系列和轴的 CartesianChart 控件。您可以使用鼠标滚动和缩放整个图表区域或单个轴。使用选项面板更改主轴设置。

# ChartControlSupportsLogarithmicScalesForAn
source: Chart Control supports logarithmic scales for any of its numeric axes. Log base 10 is default. You can specify a custom log base to change data scaling.
ru: Элемент управления Chart Control позволяет использовать логарифмические шкалы для любых числовых осей. По умолчанию применяется логарифм по основанию 10. Вы также можете задать собственное основание логарифма, чтобы изменить масштабирование данных.
zh_hans: Chart Control 支持对其任何数值轴使用对数刻度。默认情况下使用以 10 为底的对数。您可以指定自定义对数底数以更改数据缩放比例。

# ThisDemoShowsConstantLinesAndStripsUsedToH
source: This demo shows constant lines and strips used to highlight specific values and value ranges in the CartesianChart control. Right-click within the diagram to create a custom constant line for the X-axis.
ru: Этот пример показывает, как использовать постоянные линии и полосы для выделения определенных значений и диапазонов в элементе управления CartesianChart. Чтобы добавить постоянную линию для оси X, щелкните правой кнопкой мыши в области диаграммы.
zh_hans: 此演示展示了用于在 CartesianChart 控件中突出显示特定值和值范围的常量和带状区域。右键单击图表以创建 X 轴的自定义常量线。

# ThisExampleDemonstratesThePointSeriesViewW
source: This example demonstrates the Point series view, which allows you to plot individual points.
ru: Этот пример показывает, как работает представление данных Point Series View, позволяющее отображать данные в виде точек.
zh_hans: 此示例展示了点系列视图，它允许您绘制单个点。

# TheLineSeriesViewShownInThisExampleAllowsY
source: The Line series view shown in this example allows you to draw a chart by connecting points with lines.
ru: В этом примере демонстрируется представление данных Line Series View, которое позволяет построить график, где точки данных соединены линиями.
zh_hans: 此示例中展示的线系列视图允许您通过连接点来绘制图表。

# TheAreaSeriesViewAllowsYouDisplayFilledAre
source: The Area series view allows you display filled areas. This view is helpful when you need to visually compare two or more data series.
ru: Представление данных Area Series View позволяет заполнять области между графиками и осью X. Это представление полезно, когда вам нужно визуально сравнить две или более серии данных.
zh_hans: 区域系列视图允许您显示填充区域。当您需要直观地比较两个或多个数据系列时，此视图非常有用。

# TheScatterLineSeriesViewIsUsefulWhenYouNee
source: The Scatter Line series view is useful when you need to connect points in the order in which they appear in the data series.
ru: Представление данных Scatter Line Series View позволяет соединить точки в том порядке, в котором они расположены в серии данных.
zh_hans: 散点线系列视图在您需要按数据系列中出现的顺序连接点时非常有用。

# ThisExampleDemonstratesTheStepLineSeriesVi
source: This example demonstrates the Step Line series view, which connects points with horizontal and vertical line segments.
ru: Этот пример демонстрирует представление данных Step Line Series View, в котором точки соединены горизонтальными и вертикальными отрезками.
zh_hans: 此示例展示了阶梯线系列视图，它通过水平和垂直线段连接点。

# TheStepAreaSeriesViewConnectsPointsWithHor
source: The Step Area series view connects points with horizontal and vertical line segments, and fills the area between the lines and the X-axis with a specified color.
ru: В этом примере демонстрируется представление данных Step Area Series View. Оно позволяет соединить точки горизонтальными и вертикальными отрезками, а также залить области между графиками и осью X определенным цветом.
zh_hans: 阶梯区域系列视图通过水平和垂直线段连接点，并使用指定颜色填充线与 X 轴之间的区域。

# ADataSeriesInThisExampleContainsTwoYValues
source: A data series in this example contains two Y-values for each data point. The Range Area view fills the area between these Y-values.
ru: Серия данных в этом примере содержит по два значения Y для каждой точки. Представление Range Area используется, чтобы заполнить области между этими значениями Y.
zh_hans: 此示例中的数据系列包含每个数据点的两个 Y 值。范围区域视图填充这些 Y 值之间的区域。

# ThisExampleDemonstratesTheSideBySideBarSer
source: This example demonstrates the Side-by-side Bar series view which visualizes data as a set of rectangular bars.
ru: Этот пример показывает, как работает представление данных Side-by-side Bar Series View. С помощью его вы можете отображать данные в виде столбцов, расположенных рядом друг с другом на оси X.
zh_hans: 此示例展示了并排条形系列视图，它将数据可视化为一组矩形条。

# ADataSeriesInThisExampleContainsTwoYValues1
source: A data series in this example contains two Y-values for each data point. The Side-by-side Range Bar view draws rectangular bars between these Y-values.
ru: В этом примере серия данных содержит по два значения Y для каждой точки. Представление данных Side-by-side Range Bar отображает столбцы, которые строятся между этими значениями Y.
zh_hans: 此示例中的数据系列包含每个数据点的两个 Y 值。并排范围条形视图在这些 Y 值之间绘制矩形条。

# TheCandlestickSeriesViewAllowsYouToCreateA
source: The Candlestick series view allows you to create a financial chart that describes price movements of an asset. For each time period, the chart displays a data set that contains Open, Close, High and Low values. Stock data: https://www.investing.com/
ru: Представление данных Candlestick Series View позволяет строить финансовые диаграммы, отображающие изменения цен на актив. Для каждого временного интервала диаграмма показывает набор данных, включающий значения Open (открытие), Close (закрытие), High (максимум) и Low (минимум). Данные акций: https://www.investing.com/
zh_hans: 蜡烛图系列视图允许您创建描述资产价格变动的金融图表。对于每个时间段，图表显示包含开盘价、收盘价、最高价和最低价的数据集。 股票数据：https://www.investing.com/

# InThisDemoTheCandlestickSeriesViewUsesASpe
source: In this demo, the Candlestick series view uses a special data adapter (SummaryCandlestickDataAdapter) that accepts raw tick data and builds candlesticks from it. Raw ticks are single price values of an asset, taken at specific points in time. The data adapter aggregates the raw prices into candlesticks according to a specified time (measure) unit. For instance, data can be aggregated to 1 second, 1 minute, 1 hour, 1 day, 1 week, etc. or to multiples of the selected time unit such as 5 seconds, 15 minutes, 2 days, etc.
ru: В настоящем примере представление данных Candlestick Series View использует специальный адаптер данных (SummaryCandlestickDataAdapter). Этот адаптер принимает сырые тиковые данные — отдельные значения цены актива, зафиксированные в определенные моменты времени, — и преобразует их в свечи. Адаптер агрегирует сырые данные в свечи в соответствии с заданным временным интервалом. Например, данные могут быть сгруппированы в интервалы 1 секунда, 1 минута, 1 час, 1 день, 1 неделя и т.д., а также в кратные интервалы, такие как 5 секунд, 15 минут, 2 дня и т.д.
zh_hans: 在此演示中，蜡烛图系列视图使用特殊的数据适配器（SummaryCandlestickDataAdapter），它接受原始价格数据并从中构建蜡烛图。 原始价格是资产在特定时间点的单个价格值。数据适配器根据指定的时间单位将原始价格聚合为蜡烛图。 例如，数据可以聚合为 1 秒、1 分钟、1 小时、1 天、1 周等，或聚合为选定时间单位的倍数，例如 5 秒、15 分钟、2 天等。

# TheDataGridSGroupingFeatureMakesItEasyToSu
source: The Data Grid's grouping feature makes it easy to summarize information for users. They can group data by an unlimited number of columns by dragging columns onto the Group Panel.
ru: В этом примере показана функция группировки данных в контроле Data Grid. Она позволяет объединять строки по значениям выбранных столбцов. Пользователи могут группировать данные по любому количеству столбцов, перетаскивая их на панель группировки.
zh_hans: Data Grid 的分组功能使用户可以轻松汇总信息。他们可以通过将列拖到分组面板上来按无限数量的列对数据进行分组。

# YouCanEmbedAnyControlInDataGridCellsToPres
source: You can embed any control in Data Grid cells to present and edit cell data in the way you want. This demo demonstrates Eremex in-place editors: DateEditor, SpinEditor, and ComboBoxEditor. Data Grid boasts enhanced performance when you use Eremex editors in cells, particularly for large data sources.
ru: Вы можете добавлять любые UI-контролы в ячейки контрола Data Grid, чтобы отображать и редактировать данные в ячейках так, как вам удобно. Этот пример демонстрирует встраиваемые редакторы Eremex: DateEditor, SpinEditor и ComboBoxEditor. Data Grid обеспечивает высокую производительность при использовании редакторов Eremex, особенно при работе с большими объемами данных.
zh_hans: 您可以在 Data Grid 单元格中嵌入任何控件，以按您希望的方式呈现和编辑单元格数据。此演示展示了 Eremex 的内置编辑器：DateEditor、SpinEditor 和 ComboBoxEditor。当您在单元格中使用 Eremex 编辑器时，Data Grid 的性能会显著提高，尤其是在处理大型数据源时。

# TheDataValidationMechanismAllowsYouToCheck
source: The data validation mechanism allows you to check cell values and show errors in cells that contain invalid data. You can use DataAnnotation attributes and IDataErrorInfo/INotifyDataErrorInfo interface to validate data at the ItemsSource level. Toggle the 'Show ItemsSource Errors' checkbox in this demo to see data validation errors from DataAnnotation attributes. Data Grid also allows you to use the ValidateCellValue event to implement custom rules to validate user input.
ru: Механизм валидации данных позволяет проверять значения ячеек и отображать ошибки в ячейках, содержащих недопустимые данные. Вы можете использовать атрибуты DataAnnotation и интерфейсы IDataErrorInfo/INotifyDataErrorInfo для проверки данных на уровне источника данных (ItemsSource). В этом примере включите флажок 'Show ItemsSource Errors', чтобы увидеть ошибки валидации, основанные на атрибутах DataAnnotation. Data Grid также поддерживает событие ValidateCellValue, которое позволяет реализовать пользовательские правила проверки ввода.
zh_hans: 数据验证机制允许您检查单元格值并显示包含无效数据的单元格中的错误。您可以使用 DataAnnotation 属性和 IDataErrorInfo/INotifyDataErrorInfo 接口在 ItemsSource 级别验证数据。在此演示中切换“显示 ItemsSource 错误”复选框以查看来自 DataAnnotation 属性的数据验证错误。Data Grid 还允许您使用 ValidateCellValue 事件来实现自定义规则以验证用户输入。

# DataGridSupportsBuiltInDataSearchAndFiltra
source: Data Grid supports built-in data search and filtration. The Search Panel allows you to locate and highlight row cells that contain specific text. You can make the Search Panel always visible, or activate it with the Ctrl+F keyboard shortcut. The Auto Filter Row (displayed above all data rows) is used to filter data against individual columns. In code, you can customize filter conditions used in the auto-filter row for individual columns.
ru: Data Grid поддерживает встроенные функции поиска и фильтрации данных. Панель поиска позволяет находить и выделять ячейки строк, содержащие указанный текст. Вы можете сделать панель поиска постоянно видимой или открывать её с помощью комбинации клавиш Ctrl+F. Строка автоматической фильтрации (Auto Filter Row), которая отображается над всеми строками данных, используется для фильтрации данных по отдельным столбцам. В коде вы можете настроить условия фильтрации для ячеек в строке Auto Filter Row.
zh_hans: Data Grid 支持内置的数据搜索和过滤功能。搜索面板允许您定位并突出显示包含特定文本的行单元格。您可以使搜索面板始终可见，或使用 Ctrl+F 键盘快捷键激活它。自动过滤行（显示在所有数据行上方）用于根据各个列过滤数据。在代码中，您可以自定义自动过滤行中用于各个列的过滤条件。

# RegardlessOfTheNumberOfColumnsAndRowsInThe
source: Regardless of the number of columns and rows in the control, Data Grid remains responsive as you scroll the control horizontally or vertically, or sort/group its data. The built-in data virtualization mechanism updates only cells within the viewport to maintain high-performance scrolling
ru: Независимо от количества столбцов и строк, Data Grid сохраняет высокую отзывчивость при горизонтальной и вертикальной прокрутке, а также при сортировке и группировке данных. Встроенный механизм виртуализации данных обновляет только те ячейки, которые находятся в видимой области, что обеспечивает плавную и быструю прокрутку.
zh_hans: 无论控件中有多少列和行，Data Grid 在水平或垂直滚动或排序/分组数据时仍能保持响应。内置的数据虚拟化机制仅更新视口内的单元格，以保持高性能滚动。

# DataGridAdaptsRowHeightToFitCellContentsTe
source: Data Grid adapts row height to fit cell contents. Text columns can display data in a single or multiple lines. Assign a TextEditor in-place editor (or its descendant) to a column, and enable text wrapping to display text in multiple lines.
ru: Data Grid может автоматически изменять высоту строк в зависимости от содержимого ячеек. Текстовые столбцы могут отображать данные в одну или несколько строк. Чтобы включить многострочное отображение текста, назначьте столбцу встроенный редактор TextEditor (или его наследника) и активируйте функцию переноса текста.
zh_hans: Data Grid 会调整行高以适应单元格内容。文本列可以以单行或多行显示数据。为列分配 TextEditor 内置编辑器（或其派生类），并启用文本换行以多行显示文本。

# InThisDemoDataGridEmulatesTheWindowsTaskMa
source: In this demo, Data Grid emulates the Windows Task Manager by showing frequently updated fake processes. Data Grid supports automatic data updates if a bound item source implements the INotifyPropertyChanged interface. In this example, change notifications are supported for the underlying business object using the ObservableObject class (implements the INotifyPropertyChanged interface) and ObservableProperty attributes defined in the CommunityToolkit.Mvvm library.
ru: В этом примере Data Grid имитирует Диспетчер задач Windows, отображая часто обновляемые фиктивные процессы. Data Grid поддерживает автоматическое обновление данных, если связанный источник данных реализует интерфейс INotifyPropertyChanged. В данном примере уведомления об изменениях реализованы для базового бизнес-объекта с использованием класса ObservableObject (который реализует интерфейс INotifyPropertyChanged) и атрибутов ObservableProperty из библиотеки CommunityToolkit.Mvvm.
zh_hans: 在此演示中，Data Grid 通过显示频繁更新的模拟进程来模拟 Windows 任务管理器。如果绑定项源实现了 INotifyPropertyChanged 接口，Data Grid 支持自动数据更新。在此示例中，使用 ObservableObject 类（实现 INotifyPropertyChanged 接口）和 CommunityToolkit.Mvvm 库中定义的 ObservableProperty 属性支持对基础业务对象的更改通知。

# DataGridSupportsMultipleRowSelectionModeWh
source: DataGrid supports multiple row selection mode, which allows you and your user to select (highlight) multiple rows at one time. Users can select multiple rows with the mouse and keyboard. Click rows while holding the CTRL and/or SHIFT key down for row selection.
ru: Data Grid поддерживает режим множественного выбора строк, позволяющий выделять несколько строк одновременно. Пользователи могут выбирать строки с помощью мыши и клавиатуры. Для выделения строк щелкните по ним мышью, удерживая клавиши CTRL и/или SHIFT.
zh_hans: DataGrid 支持多行选择模式，允许您和用户一次选择（突出显示）多行。用户可以使用鼠标和键盘选择多行。按住 CTRL 和/或 SHIFT 键单击行以选择行。

# DataGridSupportsDragAndDropOperationsWithi
source: Data Grid supports drag-and-drop operations within the control and to external controls (for instance, Tree List or another Data Grid).This example demonstrates drag-and-drop functionality within and between Data Grids. The AllowDragDrop option activates the drag-and-drop feature. {0}The AllowDragDropSortedRows option must be enabled to allow drag-and-drop operations for sorted/grouped Data Grids. When data is sorted or grouped, a drag-and-drop operation modifies values of a dragged row in sort columns. {1}In this example, the controls are bound to collections that contain the same business objects. This ensures automatic row movement during drag-and-drop operations from the source to the target grid. When you move a row from one grid to another, a corresponding item is moved between item sources of the two grid controls.
ru: Data Grid поддерживает операции перетаскивания как внутри себя, так и на внешние контролы (например, Tree List или другой Data Grid). Этот пример демонстрирует функциональность перетаскивания внутри и между контролами Data Grid. Опция AllowDragDrop активирует функцию перетаскивания. {0} Опция AllowDragDropSortedRows должна быть включена, чтобы разрешить перетаскивание в отсортированных или сгруппированных контролах Data Grid. Если данные отсортированы или сгруппированы, операция перетаскивания изменяет значения перетаскиваемой строки в столбцах, используемых для сортировки. {1} В этом примере контролы привязаны к коллекциям, содержащим одинаковые бизнес-объекты. Это позволяет автоматически перемещать строки при перетаскивании из исходного грида в целевой. Когда вы перемещаете строку из одного грида в другой, соответствующий элемент данных перемещается между источниками данных двух гридов.
zh_hans: Data Grid 支持在控件内部和外部控件（例如 Tree List 或另一个 Data Grid）之间进行拖放操作。此示例展示了在 Data Grid 内部和之间的拖放功能。AllowDragDrop 选项激活拖放功能。{0}必须启用 AllowDragDropSortedRows 选项以允许对已排序/分组的 Data Grid 进行拖放操作。当数据已排序或分组时，拖放操作会修改拖动行在排序列中的值。{1}在此示例中，控件绑定到包含相同业务对象的集合。这确保了在从源网格到目标网格的拖放操作期间自动移动行。当您将一行从一个网格移动到另一个网格时，相应的项会在两个网格控件的项源之间移动。

# TheEremexControlsLibraryIncludesMultipleEd
source: The Eremex Controls library includes multiple editors that provide you with advanced data editing capabilities. The editors allow you to display and edit data of different data types (numeric, Boolean, date-time, enumerations, etc.). They support the data validation mechanism, styling, and embedding in container controls (Data Grid, Tree List, Property Grid, and Toolbars/Menus).
ru: Библиотека контролов Eremex включает несколько редакторов, которые предлагают расширенные возможности для редактирования данных. Эти редакторы позволяют отображать и изменять данные различных типов, такие как числовые, логические, дата-время, перечисления и другие. Они поддерживают механизм валидации, стилизацию и возможность встраивания в контейнеры, такие как Data Grid, Tree List, Property Grid, Ribbon, а также Toolbars&Menus.
zh_hans: Eremex 控件库包括多个编辑器，为您提供高级数据编辑功能。这些编辑器允许您显示和编辑不同数据类型（数字、布尔值、日期时间、枚举等）的数据。它们支持数据验证机制、样式设置以及嵌入到容器控件（Data Grid、Tree List、Property Grid 和工具栏/菜单）中。
